In [22]:
from pandas import DataFrame

In [23]:
date={'Name':['ram','bigil','tom'],
     'Age':[12,56,89],
     'salary':[123,567,890]}

In [24]:
frame=DataFrame(date)

In [25]:
frame

    Name  Age  salary
0    ram   12     123
1  bigil   56     567
2    tom   89     890

In [26]:
new_frame=DataFrame(date,columns=['Name','salary','Age'])

In [27]:
new_frame

    Name  salary  Age
0    ram     123   12
1  bigil     567   56
2    tom     890   89

In [28]:
new_frame=DataFrame(date,columns=['Name','salary','Age','Profile'])

In [29]:
new_frame

    Name  salary  Age Profile
0    ram     123   12     NaN
1  bigil     567   56     NaN
2    tom     890   89     NaN

In [30]:
new_frame['Profile']='Teacher'

In [31]:
new_frame

    Name  salary  Age  Profile
0    ram     123   12  Teacher
1  bigil     567   56  Teacher
2    tom     890   89  Teacher

In [32]:
new_frame['edu']='msc'

In [33]:
new_frame

    Name  salary  Age  Profile  edu
0    ram     123   12  Teacher  msc
1  bigil     567   56  Teacher  msc
2    tom     890   89  Teacher  msc

In [35]:
new_frame.loc[2]

Name           tom
salary         890
Age             89
Profile    Teacher
edu            msc
Name: 2, dtype: object

In [36]:
new_frame

    Name  salary  Age  Profile  edu
0    ram     123   12  Teacher  msc
1  bigil     567   56  Teacher  msc
2    tom     890   89  Teacher  msc

In [37]:
new_frame.T

               0        1        2
Name         ram    bigil      tom
salary       123      567      890
Age           12       56       89
Profile  Teacher  Teacher  Teacher
edu          msc      msc      msc